---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireType
source: html/f4d1a1cc-6968-251b-9692-247dc3ff6cff.htm
---
# Autodesk.Revit.DB.Electrical.WireType

Represents a specific wire type.

## Syntax (C#)
```csharp
public class WireType : ElementType
```